#pragma once

#include "DxLib.h"

/*****************************************************************
*   変数の宣言
*****************************************************************/

extern int g_MenuTime;				//カーソル移動用の関数０のときのみカーソル移動可能
extern int g_MenuNumber;			//ゲームスタート：０	ヘルプ画面：１		終了：２
extern int titleTime;				//画像変更よう変数６０まであって、０～３０なら１枚目。３１～６０なら２枚目の画像。画像が２枚ないなら、なくても大丈夫
extern int g_MenuY;					//カーソルのｙ座標用。なくても大丈夫

/***************************************************************************
*          関数のプロトタイプ宣言
********************************************************************************/
void DrawGameTitle(void);
